cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-versions'
tap 'pivotal/tap'
tap 'spring-io/tap'
tap 'alecthomas/homebrew-tap'

cask 'xquartz'
cask 'temurin17'
cask 'temurin18'

brew 'mas'
brew 'zsh'
brew 'zsh-completions'
brew 'tree'
brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'libgit2'
brew 'openssl'
brew 'nodejs'
brew 'readline'
brew 'postgresql@14'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'wget'
brew 'youtube-dl'
brew 'gradle'
brew 'tig'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'python'
brew 'uncrustify'
brew 'ngrep'
brew 'trash'
brew 'links'
brew 'tree'
brew 'jq'
brew 'spring-boot'
brew 'maven'
brew 'openshift-cli'
brew 'hugo'
brew 'hub'
brew 'plantuml'
brew 'groovy'
brew 'gometalinter'

## COCOA - MACOS NATIVE APPS
brew 'cocoapods'
brew 'carthage'

cask 'adium'
cask 'firefox', args: { appdir: '~/my-apps/Applications' }
cask 'slack'
cask 'transmission'
cask 'viscosity'
cask 'vlc'
cask 'spotify'
cask 'caffeine'
cask 'robo-3t'
cask 'fertigt-slate'
cask 'dropbox'
cask 'intellij-idea'
cask 'arduino'
cask 'docker'
cask 'blockblock'
cask 'knockknock'
cask 'postman'
cask 'dbeaver-community'
cask 'openemu'
cask 'hyper'
cask 'karabiner-elements'
cask 'google-cloud-sdk'
cask 'visual-studio-code'
cask 'rar'
cask 'via'
cask 'ollama'

mas 'Xcode', id: 497799835
mas 'Telegram', id: 747648890
mas 'Keynote', id: 409183694
mas 'Pages', id: 409201541
mas 'Airmail', id: 918858936
mas 'Evernote', id: 406056744
