cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'pivotal/tap'
tap 'spring-io/tap'
tap 'alecthomas/homebrew-tap'

cask 'xquartz'
cask 'temurin@17'
cask 'temurin@21'

brew 'mas'
brew 'zsh'
brew 'zsh-completions'
brew 'tree'
brew 'ack'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'libgit2'
brew 'nodejs'
brew 'readline'
brew 'postgresql@14'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spark'
brew 'wget'
brew 'yt-dlp'
brew 'sevenzip'  # Archive utility for KCC (Kindle Comic Converter)
brew 'unar'      # Alternative archive handler for KCC
brew 'gradle'
brew 'tig'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'python'
brew 'pyenv'          # Python version management
brew 'pyenv-virtualenv' # Virtual environment support for pyenv
brew 'uncrustify'
brew 'ngrep'
brew 'trash'
brew 'links'
brew 'tree'
brew 'jq'
brew 'spring-boot'
brew 'maven'
brew 'openshift-cli'
brew 'hugo'
brew 'hub'
brew 'gh'          # GitHub CLI - official GitHub command-line tool
brew 'plantuml'
brew 'groovy'
brew 'gometalinter'
brew 'bats-core'  # Testing framework for Bash scripts
brew 'ollama'     # Local LLM runner
brew 'tmux'

## COCOA - MACOS NATIVE APPS
brew 'cocoapods'
brew 'carthage'

cask 'adium'
cask 'firefox', args: { appdir: '~/my-apps/Applications' }
cask 'slack'
cask 'transmission'
cask 'viscosity'
cask 'vlc'
cask 'spotify'
cask 'caffeine'
cask 'robo-3t'
cask 'fertigt-slate'
cask 'dropbox'
cask 'intellij-idea'
cask 'arduino-ide'
cask 'docker-desktop'
cask 'blockblock'
cask 'knockknock'
cask 'postman'
cask 'dbeaver-community'
cask 'openemu'
cask 'hyper'
cask 'karabiner-elements'
cask 'gcloud-cli'
cask 'visual-studio-code'
cask 'rar'
cask 'via'
cask 'claude'  # Official Anthropic Claude desktop app
cask 'claude-code'  # Claude Code CLI - AI-assisted development tool
cask 'ghostty'
cask 'calibre'  # E-book management and conversion (for EPUB to AZW3)

# mas 'Xcode', id: 497799835
# mas 'Telegram', id: 747648890
# mas 'Keynote', id: 409183694
# mas 'Pages', id: 409201541
# mas 'Airmail', id: 918858936
# mas 'Evernote', id: 406056744
