cask_args appdir: '/Applications'

tap 'alecthomas/homebrew-tap'
tap 'koekeishiya/formulae'

# JVM toolchain (Java, Gradle, Maven, Groovy, Spring Boot CLI) is owned by
# SDKMAN — see sdkman/install.sh and sdkman/README.md. The previously-listed
# casks (temurin@17/@21) and formulae (gradle, maven, groovy) were removed
# because they hardcoded versions and fought SDKMAN over JAVA_HOME.

cask 'xquartz'

brew 'mas'
brew 'zsh'
brew 'zsh-completions'
brew 'tree'
brew 'eza'    # Modern replacement for ls
brew 'zoxide' # Smarter cd with fuzzy directory jumping
brew 'ack'
brew 'ripgrep'
brew 'coreutils'
brew 'go'
brew 'grc'
brew 'imagemagick'
brew 'jp2a'
brew 'libgit2'
brew 'nodejs'
brew 'readline'
brew 'postgresql@14'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spark'
brew 'wget'
brew 'yt-dlp'
brew 'sevenzip'  # Archive utility for KCC (Kindle Comic Converter)
brew 'unar'      # Alternative archive handler for KCC
brew 'tig'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'powerlevel10k'   # Powerlevel10k zsh theme
brew 'python'
brew 'pyenv'          # Python version management
brew 'pyenv-virtualenv' # Virtual environment support for pyenv
brew 'uncrustify'
brew 'ngrep'
brew 'trash'
brew 'duti'           # Set default apps for file types / UTIs (see macos/set-defaults.sh)
brew 'links'
brew 'tree'
brew 'jq'
brew 'openshift-cli'
brew 'hugo'
brew 'hub'
brew 'gh'          # GitHub CLI - official GitHub command-line tool
brew 'plantuml'
# brew 'gometalinter'  # Deprecated - replaced by golangci-lint
brew 'bats-core'       # Testing framework for Bash scripts
brew 'shellcheck'      # Static analysis for shell scripts
brew 'pre-commit'      # Pre-commit hook framework (see .pre-commit-config.yaml)
brew 'git-filter-repo' # Rewrite git history (replaces filter-branch)
brew 'ollama'          # Local LLM runner
brew 'beads'           # Persistent project memory / task graph for AI agents (bd CLI)
brew 'kubernetes-cli'  # kubectl - Kubernetes command-line tool
# HashiCorp Vault - installed manually via vault/install.sh (removed from Homebrew core)
brew 'tmux'
brew 'koekeishiya/formulae/yabai'   # Tiling window manager
brew 'koekeishiya/formulae/skhd'    # Hotkey daemon for yabai

## COCOA - MACOS NATIVE APPS
brew 'cocoapods'
brew 'carthage'

cask 'adium'
cask 'firefox', args: { appdir: '~/my-apps/Applications' }
cask 'slack'
cask 'transmission'
cask 'viscosity'
cask 'vlc'
cask 'spotify'
# cask 'robo-3t'  # Discontinued - merged into MongoDB Compass
cask 'fertigt-slate'
cask 'dropbox'
cask 'intellij-idea'
cask 'arduino-ide'
cask 'docker-desktop'
cask 'blockblock'
cask 'knockknock'
cask 'postman'
cask 'dbeaver-community'
cask 'openemu'
cask 'karabiner-elements'
cask 'gcloud-cli'
cask 'cursor'
cask 'visual-studio-code'
cask 'rar'
cask 'via'
cask 'claude'  # Official Anthropic Claude desktop app
cask 'claude-code'  # Claude Code CLI - AI-assisted development tool
cask 'ghostty'
cask 'raycast'
cask 'calibre'  # E-book management and conversion (for EPUB to AZW3)
cask 'font-meslo-lg-nerd-font'  # Meslo Nerd Font for terminal icons

mas 'Amphetamine', id: 937984704   # Keep-awake utility (replaces the caffeine cask)

# mas 'Xcode', id: 497799835
# mas 'Telegram', id: 747648890
# mas 'Keynote', id: 409183694
# mas 'Pages', id: 409201541
# mas 'Airmail', id: 918858936
# mas 'Evernote', id: 406056744
