# Theme and Icons
pkief.material-icon-theme
akamud.vscode-theme-onedark
teabyii.ayu

# Languages
ms-vscode.vscode-typescript-next
golang.go
redhat.java
ms-python.python
ms-azuretools.vscode-docker
batisteo.vscode-django
wholroyd.jinja

# Python Specific
ms-python.vscode-pylance
ms-python.debugpy
anysphere.pyright
donjayamanne.python-extension-pack
donjayamanne.python-environment-manager
kevinrose.vsc-python-indent
njpwerner.autodocstring
wolfieshorizon.python-auto-venv

# Java Specific
vscjava.vscode-java-pack
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-test
vscjava.vscode-maven
vscjava.vscode-gradle

# React/Web Development
burkeholland.simple-react-snippets
equimper.react-native-react-redux
msjsdiag.vscode-react-native
ritwickdey.liveserver

# Shell/Bash
timonwong.shellcheck
foxundermoon.shell-format

# Git/GitHub
eamodio.gitlens
donjayamanne.githistory
github.codespaces
github.remotehub
ms-vscode.azure-repos
ms-vscode.remote-repositories

# Remote Development
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-containers
ms-vscode.remote-explorer
ms-vscode.remote-server

# Data & SQL
mtxr.sqltools
mechatroner.rainbow-csv

# Jupyter
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow

# Utilities
esbenp.prettier-vscode
dbaeumer.vscode-eslint
christian-kohler.path-intellisense
adpyke.codesnap
clemenspeters.format-json
sallar.json-to-js-object
hediet.vscode-drawio
firsttris.vscode-jest-runner
vscodevim.vim
k--kato.intellij-idea-keybindings
withfig.fig

# AI Assistance
visualstudioexptteam.vscodeintellicode
visualstudioexptteam.intellicode-api-usage-examples 